cask_args appdir: "/Applications"


tap "adoptopenjdk/openjdk"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
tap "koekeishiya/formulae"
brew "unbound"
brew "gnutls"
brew "nghttp2"
brew "cask"
brew "chezmoi"
brew "fzf"
brew "git"
brew "go"
brew "jq"
brew "mas"
brew "neofetch"
brew "neovim"
brew "nodebrew"
brew "nvm"
brew "stow"
brew "tmux"
brew "watchman"
brew "yarn"
brew 'asdf'
# brew "starship"
# brew 'skhd'
# brew 'yabai'

cask "iterm2"
cask "spectacle"
cask "adoptopenjdk8"
cask "android-studio"
cask "app-cleaner"
cask "coteditor"
cask '1password'
cask 'docker'
cask "google-chrome"
cask "google-japanese-ime"
cask 'insomnia'
cask 'intellij-idea-ce'
cask 'notion'
cask 'skype'
cask 'zoom'
cask 'visual-studio-code'
cask 'Microsoft Teams'

# Applications install
mas "Keynote", id: 409183694
mas "LINE", id: 539883307
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Xcode", id: 497799835
mas "Microsoft Remote Desktop", id: 1295203466
mas "Microsoft Word", id: 462054705
mas "Slack", id: 803453959
mas "Spark", id: 1176895641
mas "Twitter", id: 1482454543
